Revit.Elements.Ceiling
A Revit Ceiling

Revit.Elements.Ceiling.InternalCeiling
An internal handle on the Revit ceiling

Revit.Elements.Ceiling.InternalElement
Reference to the Element

Revit.Elements.Ceiling.#ctor(Autodesk.Revit.DB.Ceiling)
Private constructor

Revit.Elements.Ceiling.#ctor(System.Collections.Generic.List{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.CeilingType,Autodesk.Revit.DB.Level)
Private constructor

Revit.Elements.Ceiling.InitCeiling(Autodesk.Revit.DB.Ceiling)
Initialize a ceiling element

Revit.Elements.Ceiling.InitCeiling(System.Collections.Generic.List{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.CeilingType,Autodesk.Revit.DB.Level)
Initialize a ceiling element

Revit.Elements.Ceiling.InternalSetCeiling(Autodesk.Revit.DB.Ceiling)
Set the InternalCeiling property and the associated element id and unique id
ceiling:

Revit.Elements.Ceiling.ByOutlineTypeAndLevel(Autodesk.DesignScript.Geometry.Curve[],Revit.Elements.CeilingType,Revit.Elements.Level)
Create a Revit Ceiling given its curve outline and Level
outlineCurves:
ceilingType:
level:
Returns: The ceiling

Revit.Elements.Ceiling.ByOutlineTypeAndLevel(Autodesk.DesignScript.Geometry.PolyCurve,Revit.Elements.CeilingType,Revit.Elements.Level)
Create a Revit Ceiling given its curve outline and Level
outline:
ceilingType:
level:
Returns: The ceiling

Revit.Elements.Ceiling.FromExisting(Autodesk.Revit.DB.Ceiling,System.Boolean)
Create a Ceiling from a user selected Element.
ceiling:
isRevitOwned:
Returns: